src/Documents/кфкВерсияСпецификации/кфкВерсияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кфкВерсияСпецификации</name>
  <registerRecords>InformationRegister.кфкВерсииСпецификации</registerRecords>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополняющаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DefinedType.кфкКомпонентСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/кфкИзмененияОбъектовСпецификаций/кфкИзмененияОбъектовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИзмененияОбъектовСпецификаций</name>
  <resources>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИзменений</name>
    <type>
      <types>EnumRef.кфкВидыИзмененияДанных</types>
    </type>
  </resources>
  <resources>
    <name>ВидПовышения</name>
    <type>
      <types>EnumRef.кфкВидыПовышенияВерсий</types>
    </type>
  </resources>
  <attributes>
    <name>БазоваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.кфкКомпонентСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкВерсииСпецификации/кфкВерсииСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкВерсииСпецификации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополняющаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкВидыПовышенияВерсий/кфкВидыПовышенияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыПовышенияВерсий</name>
  <enumValues>
    <name>ОсновнаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ДополняющаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ВерсияИсправления</name>
  </enumValues>
</mdclass:Enum>

src/Enums/кфкВидыИзмененияДанных/кфкВидыИзмененияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыИзмененияДанных</name>
  <enumValues>
    <name>Добавление</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
</mdclass:Enum>

src/Documents/кфкВерсияСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует версию спецификации
// 
// Параметры:
//	Спецификация - СправочникСсылка.кфкСпецификации - Спецификация
//	Комментарий - Строка - Комментарий
//
Процедура СформироватьВерсиюСпецификации(Спецификация, Комментарий = "") Экспорт
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.УдалитьИзмененияУдаленныхНовинок(Спецификация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.ОсновнаяВерсия КАК ОсновнаяВерсия,
	|	Т.ДополняющаяВерсия КАК ДополняющаяВерсия,
	|	Т.ВерсияИсправления КАК ВерсияИсправления
	|ИЗ
	|	РегистрСведений.кфкВерсииСпецификации.СрезПоследних(, Спецификация = &Спецификация) КАК Т
	|ГДЕ
	|	Т.Спецификация = &Спецификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыПовышенияВерсий.Ссылка КАК ВидПовышения
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(Т2.Порядок) КАК Порядок
	|	ИЗ
	|		РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т1
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.кфкВидыПовышенияВерсий КАК Т2
	|			ПО Т1.ВидПовышения = Т2.Ссылка
	|	ГДЕ
	|		Т1.Спецификация = &Спецификация) КАК ИзмененияСпецификаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.кфкВидыПовышенияВерсий КАК ВидыПовышенияВерсий
	|		ПО ИзмененияСпецификаций.Порядок = ВидыПовышенияВерсий.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Объект КАК Объект,
	|	Т.НомерВерсии КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т
	|ГДЕ
	|	Т.Спецификация = &Спецификация
	|	И Т.ВидИзменений В (ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.Добавление),
	|		ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.Изменение))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Объект КАК Объект,
	|	Т.БазоваяВерсия КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.кфкИзмененияОбъектовСпецификаций КАК Т
	|ГДЕ
	|	Т.Спецификация = &Спецификация
	|	И Т.ВидИзменений = ЗНАЧЕНИЕ(Перечисление.кфкВидыИзмененияДанных.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Текущая версия спецификации
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ОсновнаяВерсия = Выборка.ОсновнаяВерсия;
		ДополняющаяВерсия = Выборка.ДополняющаяВерсия;
		ВерсияИсправления = Выборка.ВерсияИсправления;
	Иначе
		ОсновнаяВерсия = 0;
		ДополняющаяВерсия = 0;
		ВерсияИсправления = 0;
	КонецЕсли;
	
	// Определяем новую версию спецификации
	Выборка = РезультатЗапроса[1].Выбрать();
	ВидПовышения = ?(Выборка.Следующий(), Выборка.ВидПовышения, Неопределено);
	Если ОсновнаяВерсия = 0 Или ВидПовышения = Перечисления.кфкВидыПовышенияВерсий.ОсновнаяВерсия Тогда
		ОсновнаяВерсия = ОсновнаяВерсия + 1;
		ДополняющаяВерсия = 0;
		ВерсияИсправления = 0;
	ИначеЕсли ВидПовышения = Перечисления.кфкВидыПовышенияВерсий.ДополняющаяВерсия Тогда
		ДополняющаяВерсия = ДополняющаяВерсия + 1;
		ВерсияИсправления = 0;
	ИначеЕсли ВидПовышения = Перечисления.кфкВидыПовышенияВерсий.ВерсияИсправления Тогда
		ВерсияИсправления = ВерсияИсправления + 1;
	Иначе
		ВызватьИсключение НСтр("ru = 'Нет изменений для фиксации версии спецификации'");
	КонецЕсли;
	
	ИзмененияОбъектов = РегистрыСведений.кфкИзмененияОбъектовСпецификаций.СоздатьНаборЗаписей();
	ИзмененияОбъектов.Отбор.Спецификация.Установить(Спецификация);
	
	ВерсияСпецификации = СоздатьДокумент();
	ВерсияСпецификации.Номер = СтрШаблон("%1.%2.%3",
		Формат(ОсновнаяВерсия, "ЧЦ=2; ЧН=00; ЧВН=;"),
		Формат(ДополняющаяВерсия, "ЧЦ=2; ЧН=00; ЧВН=;"),
		Формат(ВерсияИсправления, "ЧЦ=2; ЧН=00; ЧВН=;"));
	ВерсияСпецификации.Дата = ТекущаяДатаСеанса();
	ВерсияСпецификации.Спецификация = Спецификация;
	ВерсияСпецификации.ОсновнаяВерсия = ОсновнаяВерсия;
	ВерсияСпецификации.ДополняющаяВерсия = ДополняющаяВерсия;
	ВерсияСпецификации.ВерсияИсправления = ВерсияИсправления;
	ВерсияСпецификации.Автор = Пользователи.ТекущийПользователь();
	ВерсияСпецификации.Комментарий = Комментарий;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ВерсияСпецификации.ВерсииОбъектов.Добавить();
		НоваяСтрока.Объект = Выборка.Объект;
		НоваяСтрока.НомерВерсии = Выборка.НомерВерсии;
		
		НоваяЗапись = ИзмененияОбъектов.Добавить();
		НоваяЗапись.Спецификация = Спецификация;
		НоваяЗапись.Объект = Выборка.Объект;
		НоваяЗапись.БазоваяВерсия = Выборка.НомерВерсии;
		
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		
		ИзмененияОбъектов.Записать();
		ВерсияСпецификации.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
